Revit 2026 API

# AnnotationMultipleAlignmentUtils Class

---

A helper providing functionality related to elements that can be aligned to one another. An element that wants to be able to align to other alignable elements using the Multiple Alignment buttons should implement this helper class.

SystemObject Autodesk.Revit.DBAnnotationMultipleAlignmentUtils

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AnnotationMultipleAlignmentUtils : IDisposable
```
```vb
Public Class AnnotationMultipleAlignmentUtils
	Implements IDisposable
```
```cpp
public ref class AnnotationMultipleAlignmentUtils : IDisposable
```
```fsharp
type AnnotationMultipleAlignmentUtils =
    class
        interface IDisposable
    end
```

The AnnotationMultipleAlignmentUtils type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the AnnotationMultipleAlignmentUtils |
|  | ElementSupportsMultiAlign | Returns true if element can be aligned to other similar elements. |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetAnnotationOutlineWithoutLeaders | Gets the four corners of the alignable element in model space without its leaders. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | MoveWithAnchoredLeaders | Moves the element while keeping the leader end points anchored. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace